//+-------------------------------------------------------------------------
//
//  案件相关的常量
//
//  File:       case.ts
//
//  Directory:  buptlaw-frontend/src/consts
//
//  History:    6月-26-2023   QQK  Created
//
//--------------------------------------------------------------------------

export const CASE_REASON_MAP = {
  '010000': '刑事案由',
  '020000': '民事案由',
  '030000': '执行案由',
  '040000': '国家赔偿案由',
  '050000': '行政案由',
}

export const CASE_TYPE_MAP = {
  '0100': '管辖案件',
  '0200': '刑事案件',
  '0300': '民事案件',
  '0400': '行政案件',
  '0500': '国家赔偿与司法救助案件',
  '0600': '区际司法援助案件',
  '0700': '国际司法援助案件',
  '0800': '司法制裁案件',
  '0900': '非诉保全审查案件',
  '1000': '执行案件',
  '1100': '强制清算与破产案件',
  '1200': '其他案件',
}
